
# 1
# if peizhi == 1:
#     pm = 0.5
#     pc = 0.6
#     d = 15  # 滑动时间窗
#     ps_vnd = 0.05  # 变邻域下降参数
# # #2
# if peizhi == 2:
#     pm = 0.5
#     pc = 0.7
#     d = 30  # 滑动时间窗
#     ps_vnd = 0.1  # 变邻域下降参数
# # #3
# if peizhi == 3:
#     pm = 0.5
#     pc = 0.8
#     d = 45  # 滑动时间窗
#     ps_vnd = 0.15  # 变邻域下降参数
# # #4
# pm = 0.5
# pc = 0.9
# d = 60  # 滑动时间窗
# ps_vnd = 0.2  # 变邻域下降参数
# # #5
# if peizhi == 5:
#     pm = 0.6
#     pc = 0.6
#     d = 30  # 滑动时间窗
#     ps_vnd = 0.15  # 变邻域下降参数
#6
# if peizhi == 6:
#     # 6
#     pm = 0.6
#     pc = 0.7
#     d = 15  # 滑动时间窗
#     ps_vnd = 0.2  # 变邻域下降参数
# # 7
# if peizhi == 7:
#     pm = 0.6
#     pc = 0.8
#     d = 60  # 滑动时间窗
#     ps_vnd = 0.05  # 变邻域下降参数
# #8
# if peizhi == 8:
#     pm = 0.6
#     pc = 0.9
#     d = 45  # 滑动时间窗
#     ps_vnd = 0.1  # 变邻域下降参数
# # 9
# if peizhi == 9:
#     pm = 0.7
#     pc = 0.6
#     d = 45  # 滑动时间窗
#     ps_vnd = 0.2  # 变邻域下降参数
# # 10
# if peizhi == 10:
#     pm = 0.7
#     pc = 0.7
#     d = 60  # 滑动时间窗
#     ps_vnd = 0.15  # 变邻域下降参数
# # 11
# if peizhi == 11:
#     pm = 0.7
#     pc = 0.8
#     d = 15  # 滑动时间窗
#     ps_vnd = 0.1  # 变邻域下降参数
# # 12
# if peizhi == 12:
#     pm = 0.7
#     pc = 0.9
#     d = 30  # 滑动时间窗
#     ps_vnd = 0.05  # 变邻域下降参数
# # 13
# if peizhi == 13:
#     pm = 0.8
#     pc = 0.6
#     d = 60  # 滑动时间窗
#     ps_vnd = 0.1  # 变邻域下降参数
# # 14
# if peizhi == 14:
#     pm = 0.8
#     pc = 0.7
#     d = 45  # 滑动时间窗
#     ps_vnd = 0.05  # 变邻域下降参数
# # 15
# if peizhi == 15:
#     pm = 0.8
#     pc = 0.8
#     d = 30  # 滑动时间窗
#     ps_vnd = 0.2  # 变邻域下降参数
# # 16
# if peizhi == 16:
#     pm = 0.8
#     pc = 0.9
#     d = 15  # 滑动时间窗
#     ps_vnd = 0.15  # 变邻域下降参数